[
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_3_(Grimes_Cty_-_11-16-2004).pdf",
    "page": 1,
    "text": "...\n(~OL1103rm138\n:t V\\~loO\nSUPPLEMENTAL AMF.NDMENT TO THE\nOECLARA TJON OF COVENANTS. CONDITIONS AND RESTRICTIONS FOR\nPLANTATION LAKES, SECTION TB REE\nSTATE OF TEXAS §\n§\nCOUNTY OF GRIMES §\nnns SUPPLEMENTAL AMENDMENT TO THE DECLARATION OF\nCOVENANTS, CONDITlONS AND RESTRICTIONS FOR PLANTATION LAKES.\nSECTION THREE (\"Supplemcnla! Amendment'') is made on the date hereinafter set forth by.\nMill Creek, Ltd., hereinafter referred to as Declarant.\nWITNESSETH:\nWHEREAS, Declarant filed that certain DECLARATION OF COVENANTS.\nCONDITIONS AND RESTRICTIONS FOR PLANT AT !ON LAKES which is recorded under\nClerk·s File Number 403932 in the Real Property Records of Waller County, Texas. nnd under\nClerk's File Number 194638 in the Real Property Records of Grimes County, Texas (the\n\"Original Declararion''); and\nWHEREAS, Declarant filed that certain f\"IRST AMENDMENT TO THE\nDECLARATION OF COVENANTS, CONDITIONS AND RESTRlCTlONS FOR\nPLANTATION LAKES, which is recorded under Clerk's File Number 4().l501 in the Real\nProperty Records of Waller County, Texas, and under Clerk's File Number 194958 in the Real\nProperty Records ofG rimes County, Texas (the \"First Amendment\"'); and\nWHEREAS, Declarant filed lhat certain SUPPLEMENTAL AMENDMENT TO TllE\nDECLARATION OF COVENANTS, CONOITiONS AND RESTRJCTIONS FOR\nPLANT AT l ON LAKES, SECTION TWO which is m:orded under Clerk's File Number 407183\nin the Real Property Records of Waller Cowiry, Texas, and under Clerk's file Number 195110 in\nthe Real Property Records ofG rimes County, Texas (the \"Supplemental Amendment); and\nWHEREAS, the Original Declararion, Firsr Amendment, and 1he Supplemental\nAmendment arc hereinafter collectively refem:d to as the \"Declaration\"); and\nWHEREAS, reference is hereby made to the Declaration for all purposes, and any and all\nc:npilalized terms used herein shall have the meanini:s set forth in the Decl11r.1tion. unless\notherwise spcci fied in this Supplemental Amendment; and\nWHEREAS, pursuant to Article 111 of the Original Declaration, the Declarant reserved\nthe exclusive and unilateral right to annex any additional property.\nNOW THEREFORE, pursuant to the powers n:raincd by Dcclarnnt as a Class \"B\"\nMember under the Declaration, the Dcelarnnt hereby annexes the real property as shown on the\nmap or plat thereof recorded in Volume 1102, Page 813 in the Map or Plat Records of Grimes\nCounty, Texas (the \"Subdivision\") into Planlation Lakes. The Subdivision shall hereinafter carry"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_3_(Grimes_Cty_-_11-16-2004).pdf",
    "page": 2,
    "text": ".\nf .\n.\n'\nI\n~-\nt'\nI•\nr\nr\nwith it all the rights, privileges and obligations granted to the Property initially encumbered by\nthe Declaration, including but not limited to the right to be annexed, and is hereby annexed into\nthe body of the Property subject to the Declaration without approval of the Class \"A\"\nMembership.\nNo Dwelling or other strucrure shall be eiccted nearer to any street or property line than\nthat allowed by the applicable plat or other recorded documents, provided that a minimum rear\nsetback equal to twenty-five feet (25 ') or the rear utility casement as shown on the applicable\nplat of the Subdivision, wruchever is greater, shal.l be observed on all Lots; and, provided further\nthat a minimum side setback equal to twenty-five foot (2S') or the· side utility easement as shown\non the applicable plat of the Subdivision, whichever is greater, shal.l be observed on a.II Lots.\nDetached garages and driveways shall be permitted to be placed within a setback as approved by\nthe ARC.\nOwners of Lot I, Block I in the Subdivision are hereby advised that there exiSIS a fifty.\nfoot (50') drainage easement on the eastern Lot line of Lot I, Block I, as shown on the reconled\nplat of the Subdivision (the \"SO' Drainage Easement\"). Owners hereby agree to hold harmless\nthe Declarant and the As.~ociation, and their successors and assigns and release them from any\nliability for the existence and/or placemem of the SO' Drainage Easement and ugrec to indemnify\nthe parties released from any damages they may sustain. Owners further grant an casement to\nthe Declarant a.nd the Association for any incidental noise, odors, visibility of the SO' Drainage\nEasement, and/or traffic which may occur due to the existence of the 50' Drainage Easement.\nOwners hereby acknowledge that the Associatico, its directors, officers, managers, agents, or\nemployees, the Declar.mt or any successor Dcclarant have made oo representations or wanaoties\nnor bas any Owner, occupant, tenant, guest or invitee relied upon any representations or\nwarranties, expressed or implied, relative to water level variances and/or any futwe change in\nso·\nuse of the Drainage Easement. Each Owner shall have the obligation of maintaining lbe\nportion of the SO' Drainage Easement on such Owner's Lot Owners may not obstruct, fill, alter\nthe natural slope of, a.her the topography of, or install any improvements OD the SO' Drainage\nEasement.\nOwners of Lot 8, Block 1 in the Subdivis:ion arc hereby advised that there exist several\nthirty-foot (30') drainage easements along ccnain Lot lines of Lot 8, Block I, as shown oo the\nrecorded plat of the Subdivision (the \"30' Drainage Easements\"). Owners hereby agJee to bold\nhannless the Dcclarant and the Association, and their successors and assigns and release them\nagree\nfrom any liability for the existence and/or placement oft he 30' Drnioage Easements and to\nindemnify the parties released from any damages they may sustain. Owners further grant an\neasement to the Dcclarant and the Association for any incidental noise, odors, visibility of the\n30' Drainage Easements, and/or traffic which may occur due to the existence of the 30' Drainage\nEasements. Owners hereby acknowledge that the Association, its directors, officers, managers,\nagents, or employees, the Dcclarant or any suecessor Declarant have made no representations or\nwarranties nor bas any Owner, occupant, tenant, guest or invitee relied upon any representations\nor wanaotics, expressed or implied, relative to water level variances and/or any future change in\nuse of the 30' Draloage Eascmcots. Each Owner sbalJ have the oblig;i.tioo of maintaining the\nportion oft he 30' Drainage Easements on such Owner's Lot Owners may not obslruct, fill, altec\n~1:\n2\n'II)"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_3_(Grimes_Cty_-_11-16-2004).pdf",
    "page": 3,
    "text": "tvot1103PACE140\nthe 113turaJ slope of, airer the topography of, or install any improvem~'lllS on the 30' Drainage\nEasements.\nOwners of Lois 7, 8, and 9, in Block I in the Subdivision are hereby advised that there\ncxistS a lhirty-foot (30') right of way easement granted to Enserch Corp. (more particularly\ndescribed in Volume 504, Page 783 in the Official Public Records of Waller County) that runs\nthrough Lots 7, 8, and 9, in Block I (the \"Right of Way\"). Owners hereby agree to hold\nharmless the Declarant and the Association, and their successors and assigns and release them\nfrom any liability for the existence and/or placement oft he Right ofW ay and agree 10 indemnify\nthe parties released from any d11r113ges they may susrain. Owners further gram an easement to\nthe Declarant and the Association for any incidental noise, odors, visibilily of the Right of Way,\nand/or traffic which may occur due to the existence of the Right of Way. 0--ners hcr~by\nacknowledge that the Association, ils directors. officers, managers, agents, or employees. chc\nOeclarant or any successor Declarant have made no representations or warranties nor ha.~ any\nOwner, occupanl, tenant, guest or invitee relied upon any represen!ations or wanantics_\nexpressed or implied, relative to any future change in use of the R.ight of Way. Each Owner shall\nhave the obligation of maintaining the portion of the Right of Way on such O\"ner\"s Lot.\nOwners may not obstruct, fill, alter the natural slope of, alter the topography of. or inscall any\nimprovements on the Right of Way.\nOwners of Lots 16 and 17. Block 1 in the Subdivision are advised 1ha1 chcre exisrs a fom\nfool (40') drainage ca~ement along the westcm Lot line of Lot 16. Block 1 and on 1he ~asccm Lot\nline of Lot 17, Block I, as shown on the recorded plat of the Subdivision and 0.-11ers oflot 10.\nBlock 1 are advised that there exists a forty foot (40') drainage easement along the northern Loi\nline of LOI 20, Block 1, as shown on the recorded plat of the Subdivision (collectiwly. the ··40·\nDrainage Easements\"). Owners hereby agree to hold harmless 1he Declaranc and chc\nAssociation, and their successors and assigns and release them from any liabiliiy for chc\nexistence and/or placement of the 40' l)rnjnagc EascmcnL~ Md agree to indemnify the parties\nreleased from any damages they rl!3Y sustain. Owners fuoher grant an easement 10 the Declarant\nand the Association for any incidental noise, odors, visibilily of the .io· Drainage Easemcncs.\nand/or traffic which may occur due to the existence of the 40\" Drainage Easements. Owners\nhereby acknowledge that the Association, it' directors, officers, managers, agents, or employees,\nthe Declarant or any successor Declarant have made no representations or warranties nor has any\nOwner, occupant, tenant, glJCSt or invitee relied upon any representations or w:uranties.\nexpressed or implied, relative to waler level variances and/or any fumre change in use of the 40\"\nDrainage Easements. Each Owner shall have the obligation of maintaining the portion of the 40'\nDrainage Easements on such Owner's Lor. Owners may not obstruct, fill. alter the natural slope\nof, alter the topog;aphy of, or insla!J any improvectcnts on the 40\" Drainage Easements.\nOwners of Lot 22, Block I in the Subdivision are advised that there exists a twenty-five\nfoot (2S') drainage easement along the western perimeter of Restricted Reserve Band the eastern\nLot line of Lot 22, Bloc.k I, as shown on the recorded plat of the Subdivision and Owners of Lot\n42, Block I arc advised that there exists a twenly·five fool (25') droinage casement on the\nnoohem Lot line of Lot 42, Block I. as shown on the recorded plat of the Subdi,~sion\n(collectively, the \"25' Drainage Easements\"). Owners hereby agree to hold harmless the\nOeclarant and the Association. and their successors and assigns and release tl1em from any\n3"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_3_(Grimes_Cty_-_11-16-2004).pdf",
    "page": 4,
    "text": ",-\nVOl.1103PAG£141'\nliability for 1hc existence and/or placement of 1hc 25' Drainage Easements and agree to\nindemnify 1hc parties released from any damages 1hey may sustain. Owners further g13J1t an\ncascmem to the D~larant and the Association for any incidental noise, odors, visibility of the\n25' Drainage Easements, and/or traffic which may occur due to the existence of the 2.5' Drainage\nEasements. Owners hereby acknowledge that lhe Association, its directors, officers, managers,\nageolS, or employees, the Dcclarant or any successor Dcclarant have made no representations or\nwarranties nor bas any Owner, occupant, tenant, guest or invitee relied upon any representations\nor warranties, expressed or implied, relative to water level variances and/or any future change in\nuse of the 25' Drainage Easements. Each Owner shall have the obligation of maintaining the\nportion oft he 2.5' Drainage Easements on such Owner's LoL Owners may not obstruct, fiU. alter\nthe natural slope of, alter the topography of, or install any improvements on the 25' Drainage\nEasemen1s.\nOwners of Lots within the Subdivision are advised that there exists Restricted Reserve\n\"A\" (hereinafter the \"Park Area\") which reserve is restricted in its use to park use. Owners of\nLots wi1hin the Subdivision hereby agree to hold hannless the Dcclarant and the Association,\nand their successors and assigns, and release them from any liability for the placement,\nconstruction, design. operation, and maintenaoce of said Park Area any recreational facility,\nequipment, dock, or pier, if any, in said Park Area, and agree to indemnify lhc parties released\nfrom any damages Ibey may sustain. Owners further grant an easement to the Dcclarant and the\nAssociation for any incidental noise, lighting, odors, parking and/or traffic which may occur in\nthe nonnal operation of the Park Area or any recreational facility, equipment, dock, or pier, if\nany, in said Parle Arca. The Declarant, its successors and assigiis, and/or lhc Association has the\nright to promulpte rules and regulations governing the use of the Park Arca. Owners hereby\nacknowledge that the Association, its directors, officers, managers, agents, or employees, the\nDcclarant or any successor Declarant have made oo representations or warranties nor has any\nOwner. occupant, tenant, guest or invitee relied upon any representations or warranties,\nexpressed or implied, relative to any future change in use of the Parle Arca.\nOwners whose lots arc adjacent to or abut tho Park Area shall take care and shall not\npermit any trash, fertilizers, chemicals, petroleum products, eoviromncotal hazards or any other\nforeign matters to infiltrate the Park Area. Any owner permitti113 or causing sucb infiltration\nshall indemnify and hold hannless the AMoc:iation for all costs of clean up and remediation\nneccssruy to restore the Parle Arca to its condition imroediately prior to said inftltration. The\nDcclaran1, its successors and assigns, and/or the Association has the right to promulgate rules\nand regulations governing the use of the Parle Area and, a dock, pier, or recreation equipment if,\nas. and when such dock, pier, or recreation equipment is built, placed, or installed in the Park\nArea.\nj· Park Area Easement There is hereby reserved and granted to the Owner of that portion\nof the Subdivision bercinabove defined as the Parle Area along with such Owner's servants,\nI independent contractors, agents, members, guests and invitees (coll~tively, the \"Park Arca\nUsers\"), a nonexclusive easement over and across the Subdivision, or portions thereof as\nprolrided below, for the following pwposcs:·\n4"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_3_(Grimes_Cty_-_11-16-2004).pdf",
    "page": 5,
    "text": "...\n... .... ..:..--'-\n:-- -\n----·--·------.-..\n.:..\nlvoL1103PAGE142\n(i) Flight of balls {which may i.nclude but not be limited to baseballs, softballs,\nfootballs, tennis balls, soccer balls, volley balls) over, across, and upon the\nSubdivision;\n(ii) Doing of every act necessary and incident to the playing of recreational activities\non or within the Park Area, including, lighting of parking facilities; and\n(iii) Creation of noise related to the nonnal maintenance, operation and recreational\nactivities of the Park Area, including, but not limited to, the operation of mowing\nand spraying equipment. Such noise may occur from early morning until late\nevening.\nPamage by Errant Soons Balls. Owners of portions of the Subdivision, their successors\nand assigns, hereby acknowledge and agree that the existence of a Perl: Area within the\nSubdivision is beneficial and highly desirable; however, each such Owner acknowledges and\nagrees that portions of the Subdivision located adjacent to, or in close proximity to, the Park\n=\nAie:i. subject to the risk of damage OT injury doe 10 errant sports balls. Owners of ponions of\nthe Subdivision, their successors and assigns, hereby assume the risk of damage and injury and\nhereby release the owner of the Park Arca, the Association and/or the Declarant, their age111s,\nemployees, officers, suCCCSSOIS and assigns, from any and all liability for damage OT injury\ncaused by errant si>orts balls in, on, or around the Subdivision.\nOwners of Lots within the Subdivision are advised that there exists Restricted Reserve\n''B~, which is ~trictcd to pond/detention area use as shown on the recorded plat of the\nSubdivision (the \"Reserve B\"). The Association shall have the obligation to maintain the\nDetention/Open Space Reserve. Owners hereby agree to bold hannless the Declarant and the\nAssociation, and their successors and assigns and releao;e them from any liability for the\nexistence, placement, and/or maintenance of Reserve B and agree 10 indemnify the parties\nreleased from any damages they may sustain. Owners acknowledge that there may be incidental\nnoise, lighting, odors, and/or traffic which may occur due to the existence and/or norm:i.1\noperation of Reserve B and Owners expressly grant to the Association, an easement for\nincidental noise, lighting, odors and/or traffic which may occur due to the existence and/or\nnormal operation of Reserve B. The Occlarant, its successors and assigns, and/or the\nAssociation has the right 10 promulgate rules and regulations governing the use of Reserve B.\nOwners further acknowledge that the Association, its directors, officers, managers, agents, or\nemployees, the Declarant or any successor Dcclarant have made no representations or warranties\nnor has any Owner, occupant, tenant, guest or invitee relied upon any representations or\nwarranties, expressed or implied, relative to water level variances and/or any future change in\nuse of Reserve B. Owners whose Iota are adjacent to or abut Reserve B shall take care and shall\nnot permit any trash, fertiliztts, chemicals, petroleum products, environmental h:izards or any\nother foreign matters to infiltrate Reserve B. Any owner permitting or causing such infiltrdtion\nshall indemnify and bold bannlcss the Association for all costs ,of clean up and remediation\nnecessary to restore Reserve B to its condition immediately prior to said infilttation.\nOwners of Lots wilbin the Subdivision are advised that there exists Restricted Reserve\n''C», portions of which are designated for any oil, gas and mineral development within the\ns"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_3_(Grimes_Cty_-_11-16-2004).pdf",
    "page": 6,
    "text": "{.\n'\n.V OL1103PACE143.\nSubdivision (the \"Drill Site\"). The Association sball have the obligation lo maintain Reserve\n''C'. Owners hereby agree to bold banoless the Dcclar.m.t, the Association and their successors\nand assigns and release lhcm from any liabilil)' for the existence, placemcnl, operation and/or\nmaintenance of the Drill Sile and agree to indemnify the parties released ftom any damages they\nmay sustain. Owners acknowledge that there may be incidental noise, lighting, odors, and/or\ntraffic which may occur due to the cxis1cnce and/or normal operation of the Drill Site and Owner\nexpressly grants to the Dcclarant and the Association, an easement for incidental noise, lighting,\nodors and/or traffic which may occur due to the existence and/or normal operation of the Drill\nSite.\nOwners further acknowledge that the Association, its Directors, officers, managers,\nagents, or employees, or the Dcclarant or any successor Declarant have made no representations\nor warranties nor has any Owner, occupanl, tenant, guest. or invitee reljed upon any\nrepresenlations or warranties, expressed or implied, relative to any future change in use of the\nDrill Sile or regarding the affect of the Drill Site designation. Owners whose Jot abut or are\nadjacent to the Drill Site shall take care and shall 001 permil any trash, fe11ilizers, chemicals,\npetroleum products, environmental hazards or any other foreign matters to in.filtrate the Drill\nSite. Any Owner permitting or causing such infiltration shall indemnify and bold banolcss the\nDeclarant, the Association and their successors and assigns for all costs of clean up and\nremediation necessary lo reslore the Drill Site lo its condition immediately prior to said\ninfiltration. Owners acknowledge lhal the Declarant and/or the Association may convey the Drill\nSite to a person and/or entity other than the Association.\nOwners of Lots within the Subdivision arc advised that certain land along the northern\npcriimter of the Subdivision is owned by the Texas Rell.lissancc Festivals, Inc. (the \"Land\").\nOwners acknowledge and understand that the Association, its Board of Directors, and/or the\nOeclarant, their successors and assigns, arc not insurers and that each owner and occupant of any\nlot in the Subdivision and each tenant, guest and invilcc of any owner assumes all risks for loss\nor damage to persons, and further acknowledges tbat the Association, ilS Board of Directors,\nand/or lhe Owner, their suc~sors and assigns, have made no representations or wamnties nor\nbas any Owner, occupant, lenant, guest or invitee relied upon any representations or warranties,\nexpressed or implied as to the safety of the Land or the activities conducted thereon. Owners\nhereby agree to hold harmless the Oeclarant, the Association and their successors and assigns\nand release them from any liability for the existence, placement, Opl'ration and/or maintenance of\nthe Land and for any activities conducted on the Land, and agree to indemnify the parties\nreleased from any damages they may sustain. Owners acknowledge that there may be incidcnta.I\nnoise, lighting, odors, and/or 1raffic which may occur due to the existence, normal operation,\nand/or maintenance oft he Land and/or the activities conducted on the Land.\nOwners wb06e lots abut the Land shall take care and shall not permit any trash,\nfertilizers, chemicals, petroleum products, environmental hazards or any other foreign matters to\ninfillrate the Land. Any owner permitting or causing such infiltration shall indemnify and hold\nbann.less the Association for all coslS of clean up and remediation necessary to restore the Land\nto its condition immediately prior to said .infi!ltration. Owners further acknowledge that the\nAssociation, its dinictors, officers, managers, agents, or employees, the Declarant or any\nsuccessor Declarant have made no representations or wamnties nor bas any Owner, occupant,\n6"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_3_(Grimes_Cty_-_11-16-2004).pdf",
    "page": 7,
    "text": "...\n-· .\n-.\n- ·----·-' ------------..\n.:.--.\nkvot1103PAC{144\ntenant, guest or invitee reliecf upon any representations or wananties, expressed or implied,\nrelative to any future change in use of the Land.\nOwners of Lots 8 and 9 in Block I are advised that ponions along the eastern perimeter\nof Lots 8 and 9 lie in FEMA Zone A and arc partially within the 100 year floodplain as per\nFEMA Panel No. 480640 0020 B. The approximate location of the JOO year flood ?.one is on the\neastern perimeter of Lots 8 and 9 in Block I, as indicated oo the recorded plat Owners of Lots 8\nand 9 in Block I acknowledge and understand that the Association, its Board of Directors, and/or\nthe Declaraot, their successors and assigns, are not insurers and that each Owner and occupant of\nany lot in the Subdivision and each tenant, guest and invitee of any Owner assumes all ri~ks for\nloss or damage to persons as a result of the a portion of Lots 8 and 9 in Block I being located in\nthe I 00 year flood zone. Owners further acknowledge that the Association, its Board of\nDirectors, and/or the Owner, their successors and assigns, have made no representations or\nwarranties nor has any Owner, occupant, tenant, guest or invitee relied upon any representations\nor warranties, expressed or implied as to the flood wne.\nFencing may be installed on Lots which abut green bells, lakes, ponds, park areas and\nother landscaping reserves. If fencing is installed on any portion ofa Lot which abuts greenbelts.\nlakes, ponds, park areas and other landscaping reserves, it shall be wrought iron in appearance\nand shall be in a location and of a material and design as required in this Section and as approved\nby the ARC. However, access to such green belts. lakes. ponds, park areas and!or other\nlandscaping reserves, if any, shall be through approved access pointS located on the Common\nAreas only. Gate access from individual Lots is strictly prohibited except on rear Lot lines\nadjacent to green belts, which rear gates are subject to prior ARC approval. An Owner's Lot\nshall be considered a abuning a lake, pond, or park area for fencing requirements e\\'en if a\ncommon area is between the Lot and such lake, pond or park area.\n~ial Fencing R~: Side fencing berween any and all LOtS. if any is installed.\nwhere the renr and/or side of the Lot abuts and/or is contiguous or adjoining to green belts, lakes.\nponds, park areas or olhcr landscaping reserves shall be black ornamental iron in appearance.\nunl~ otherwise approved by the ARC. All such fencing, if installed, shall not exceed four feet\n(4 ') in height and must conform to all ARC requirements.\nSubject to the special fencing requirementS set out hereinabove. side and rear fencing\nmay be installed on all Lots; provided, such fencing is not a barbed wire or a chain link fence.\nOwners sbaJJ be responsible for the maintenance, repair and/or replacement of all fences\nin existence at time of transfer from Builderto Owner. Replacement fences shall be ofa similar\nmaterial and design as originally constructed. The maintenance of any portion of a fence which\nlies between Lots shall be the joint responsibility of each Lot owner on whose propcny the fence\nJjes between. Jn the event an Owner fails to repair, replace or maintain said fence in a manner\nconsistent with the subdivision in the sole discretion of the Boaro of Directors. the Association\nshall have the right, but not the obligation, to enier such propcny for the repair andior\nreplacement of such fence after notice to the Owner. Any expense incurred by the Association in\neffectuating such repairs/replacement shall be the responsibility of the Owner and shall be\nsecured by the continuing lien on the Lot\n7"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_3_(Grimes_Cty_-_11-16-2004).pdf",
    "page": 8,
    "text": ",.\nVOL1103PAC(145\nJc\n~ .\nThe Subdivision shall be held, transferred, sold, conveyed, used and occupied subject to !'\nlhe covenants, restrictions, easements, charges, and liens set forth in the Declaration (the same\nbeing herein incorporated by reference for all purposes), and additionally this Supplemental !l .\nAmendment. !.\nIn case of conflict between this Supplemental Amendment and the Declaration, this\nSupplement.al Amendment sball control. All other definitions and restriction shall remain as '\ni\nstated in the Declaration.\nInvalidation of any one or more of the covenants, restrictions conditions or provisions\ncontained in this Supplemental Amendment shall in no wise affect any of the other covenants, i I\nrestrictions, conditions or provisions which shall remain in full force and effect\n[SIGN AT IJRE PAGE FOLLOWS]\n!\n! :\nI\n~ .\n! \"\nI\n,l\nI\n_\nI\nI,\n8\n_____ !\n-· ------ ,, . ---·. ---·- . - 1 s ; , -\n-~-·-~-----·"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_3_(Grimes_Cty_-_11-16-2004).pdf",
    "page": 9,
    "text": "...\n'VOl.1103 PAC£146\nIN WITNESS WHEREOF, this Supplemental Amendment to the Dcclamtion of\nCovenants, Conditions and Restrictions for Plantation lalces, Section Three is executed as of the\n\\c..~ day of N~~~blA. 2004.\nDECLARANT:\nMILL CREEK, LT O., a Teus limited\npartnership\nBy: DEVELOPMENT\nTexas corporation, its\nSTATE OF TEXAS §\n§\nCOUNTY OFffio.,7jo\"\"\"1 §\n'\\I BEFORE ME, thc undersigned autJ1ori1y, on this day personally appeared\n0\nQ?'ryS·:tl\"'r the r:_rLs·,d.LJ of Clear Springs Development Group. L.L.C., a\nTexas corporation, the Gener.ti Partner of Mill Creek, Ltd., a Texas limited partnership knoY.11 by\nme to be the person whose name is subscribed to the foregoing insaumenl. and acknowledged to\nme that slbe executed the same for the pwposes and consideration therein expressed and in the\ncapacity therein expressed.\nGIVEN UNDER MY HAND AND SEAL Ofl OFFICE, this 11o#. day of Nw t.o-~\n2004.\n~ : ~ , \\ NO C M t A l' y Y A C N < o : ll l m h F f ~ r . i S s S s C t i H o a U t n e E E o L t ' K l 1 > E e ft• d 1\n~i~~1 S1pl11nDtl t 1. 2007\n~jm• RcDamlo;\nMan: 0. Marl<cl\nRobcns Martel Oucny, P.C.\n:U00 City West Blvd, Suitt 1350\nHOUSloa, 1X 77042\ni\nI\n9\n.I"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_3_(Grimes_Cty_-_11-16-2004).pdf",
    "page": 10,
    "text": ",,\n. I!\n····-1-\n· vot1103Pm147\nLIENHOLDER CONSBNT AND SUBORDJNATION\n----------~ a(n) State Corporation,\nbeing the sole beneficiaJy of a mortgage lien and other liens, assignments and security iriterests\nencwnbcring all or a pol1ion of the Property hereby consents to the tMnS and provisions of this\nSllj)plcmental A.mcodroent to the Declaration of Covenants, Conditions and Restrictions for\nPlantation Lakes, Section Three to which this Licnholder Conse:at and Subordination is attached\nand acla>owlcdgcs tlW the execution thereof does not constitute a default under tbc lien\ndocument or any other document executed in coDDCCtioo with or as security for tho indebtedness\nabove doscribcd, and subordinates the liens of the lien document aod any other liens and/or\nsecurity instNments securing said indebtedness to the rights and interesls created under the\nDeclaration, and acknowledges and agrees that a forcoloswc of said liens andfor security\ninterests shall not cxlillguish the rights, obligations and interests created under the Declaration.\nNo wam.ntics of title are bcteby made by licaholdcr, licaholder's joinder herein being solely\n,;:;;;e_\n\"\"\"\"•-•~-\"\"'w\"\"\"\"\"'~ :;;,,_~\nPrinF--------------\nSTATE OF TEXAS §\n§\nOF~~\nSCtO UNTY .\n1<&.ibC\ne J P e A rs B o AE n F)O RE 'P undersign o e f d J f ) o t r e e :~ g · o ., /. i .. o J n ~ l i th ~ is ~d d a y pm kn o o n w a n l l b y y m ap e p e to a r b e e d\nwhose name is subscribed to the acknowledged to me that\ns/he executed the same for the purposes and consideration therein expressed and in her/his\nrep~wivc capacity.\nUNDER my band and seal of office, this / .)/ri day of\n.2004.\n94·~\nNotal)' Public - State of Texas\nJt\nAller RcCO!!ljoa Re!um'.Co:\nMatcD.Mutccl\nR.obel1s Mllkel Gucny. P.C.\n2$00 Ci\\Y Wc:st Blvd., Suite 1350\nHou.ton, TX 77042\n...\n. $t . .U .,. IC .... J .. m ,. > _. S ._ .._ '* _ _ ..,. _ .., , , , .. , _ _\n-.: \"' .:> ~ ::.'.!\n:a:.-=::.:~~: ~~ :z r-\n..;: = tT1\n\"' <:: c:>\nNOV 1_ 6_ 3X_J4 _ 1~\nC...7...).\nQ \"T l .....\n=- :::::>\n...,, e \".,....,'. : - : 0 3 , ( : m : . : \" :: , ) > N e C n D\n~ L~ ~ ...... :J ~ CD\n: - \" : ' ; · x : r \" \" - ' c <. o .) .> c .. :> . . -- ~ o'~ o C7)\n---··-···· ·\n..."
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_4_-_11-02-2005.pdf",
    "page": 1,
    "text": "'\n.\nOo.=\n(1 1:::1 2 •=t 3 ::!: .l l f h ~ _ - · 1 F ·: · Vol\nll47\nSUPPLEMENTAL AMENDMENT TO THE\nDECLARATION OF COVENANTS, CONDlTlONS AND RESTIUCTIONS FOR\nPLANTATlON LAKES, SECTlON FOUR\nSTA TE OF TEXAS §\n§\nCOUNTY OF GRIMES §\nTI~IS SUPPLEMENTAL AMENDMENT TO THE DECLARATION OF\nCOVENANTS, CONDITIONS AND RESTRICTIONS FOR PLANTATION LAKES,\nSECTION FOUR (the \"Supplemental Amendment\") is made on the date hereinafter set forth by,\nMill Creek, Ltd., hereinafter referred to as \"Declarant.\"\nW IT N E S S E T H:\nWHEREAS, Declarant filed that certain DECLARATION OF COVENANTS,\nCONDITIONS AND RESTRICTIONS FOR PL.ANTATION LAKES which is recorded under\nClerk's File Number 403932 in the Real Property Records of Waller County, Texas, and under\nClerk's File Number 194638 in the Real Property. Records of ·Grimes County, Texas (the\n\"Original Declaration\"); and ·\nWHEREAS, Declarant filed that certain FIRST AMENDMENT TO TilE\nDECLARATION OF COVENANTS, CONDITIONS AND RESTIUCTIONS FOR\nPLANTATION LAKES, which .is recorded under Clerk's File Number 40450 I in the Real\nProperty Records of Waller County, Texas, and under Clerk's File Number 194958 in the Real\nProperty Records of Grimes County, Texas (the \"First Amendment\"); and\nWHEREAS, Declarant filed that certain SUPPLEMENTAL AMENDMENT TO Tiffi\nDECLARATION OF COVENANTS, CONDITIONS AND RESTIUCTIONS FOR\nPLANTATION LAKES, SECTION TWO which is recorded under Clerk's File Number 407183\nin the Real Property Records of Waller County, Texas, and under Clerk's File Number 195110 in\nthe Real Property Records of Grimes County, Texas; and\nWHEREAS, Declarant filed that certain SUPPLEMENTAL AMENDMENT TO TilE\nDECLARATION OF COVENANTS, CONDITIONS AND RESTIUCTIONS FOR\nPLANTATION LAKES, SECTION THREE which is recorded under Clerk's File Number\n408945 in the Real Property Records of Waller County, Texas, and under Clerk's File Number\nr 195960 in the Real Property Records of Grimes County, Texas;\nr\nWHEREAS, the Original Declaration and the First Amendment are hereinafter\ncollectively referred to as the \"Declaration\"; and\nWHEREAS, reference is hereby made to the Declaration for all purposes, and any and al I\ncapitalized terms used herein shall have the meanings set forth in the Declaration, unless\notherwise specified in this Supplemental Amendment; and"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_4_-_11-02-2005.pdf",
    "page": 2,
    "text": "·=\n1 I . : > I I < = .:> I :...? I =I : ') -.. ~ _t_ j c f.. . .: 1 J . -\" : > \\ t j '. L l , J .., / / . > :;- 1 :.J - 1;\nWHEREAS, rursuant to Aniclc Ill of the Original Declaration, the Declarant reserved\nthe exclusive and unilateral right to annex any additional propcr1y.\nNOW THEREf'ORE. pursuant to the rowers retained by Declarant as a Class ··B ..\nMember under the Declaration, the Declarant hereby annexes the real property as shown on the\nmap or plat thereof recorded in Volume 1146, Page 94 in the Map or Plat Records of Grimes\nCounty, Texas (\"Section four\") into Plantation Lakes. Section Four shall hereinafter carry witJ1\nit all the rights, privileges and obligations granted to the Propeny initially encumbered by the\nDeclaration, including but not limited to the right to be annexed, and is hereby annexed into the\nbody of the Proper1y subject to the Declaration without approval of the Class \"A\" Membership.\nNo Dwelling or other structure shall be erected nearer to any street or proper1y line than\nthat allowed by the applicable plat or other recorded documents, provided that a minimum rear\nsetback equal to twenty-five feet (25') or the rear utility easement as shown on the applicable\nplat of Section Four, whichever is greater, shall be observed on all Lots; and, provided fur1her\nthat a minimum side setback equal to twenty-five foot (25 ') or the side utility easement as shown\non the applicable plat of Section Four, whichever is greater, shall be observed on all Lots.\nDetached garages and driveways shall be permitted to be placed within a setback as approved by\nthe ARC.\nOwners of Lots within Section Four are advised that there exists Restricted Reserve \"A\"\n(hereinafter, the \"Park Area\"), which reserve is restricted to park use. Owners of Lots within\nSection Four hereby agree to hold harmless the Declarant and the Association, and their\nsuccessors and assigns, and release them !Tom any liability for the placement, construction,\ndesign, operation, use and maintenance of said Park Area, any recreational facility and/or\nequipment., if any, in said Park Area, and agree to indemnify the par1ies released from any\ndamages they may sustain. Owners further grant an easement to the Declarant and the\nAssociation for any incidental noise, lighting, odors, parking and/or traffic which may occur in\nthe normal operation and use of the Park Area or any recreational facility or equipment, if any, in\nsaid Park Area. The Declarant., its successors and assigns, and/or the Association has the right to\npromulgate rules and regulations governing the use of the Park Area. Owners hereby\nacknowledge that the Association, its directors, officers, managers, agents, or employees, the\nDeclarant or any successor Declarant have made no representations or warranties nor has any\nOwner, occupant, tenant, guest or invitee relied upon any representations or warranties,\nexpressed or implied, relative to any future change in use of the Park Area.\nOwners whose Lots are adjacent to or abut the Park Area shall take care and shall not\nr permit any trash, fertilizers, chemicals, petroleum products, environmental hazards or any other\nr\nforeign matters to infiltrate the Park Area. Any Owner penmitting or causing such infiltration\nshall indemnify and hold hanmless the Association for all costs of clean up and remediation\nnecessary to restore the Park Area to its condition imrnediately prior to said infiltration. ·rhe\nDeclarant, its successors and assigns, and/or the Association has the right to promulgate rules\nand regulations governing the use of the Park Area and/or recreation equipment if. as. and when\nsuch recreation equipment is built, placed, or installed in the Park Area.\nor\nPark Arca Easement. There is hereby reserved and granted to the Owner that portion\nof Section r-our hercinabovc defined as the Park Area along with such Owner's scrvan1s.\n7"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_4_-_11-02-2005.pdf",
    "page": 3,
    "text": "0 (1 1 0 = 1 · 2 .: : 1:i :s::?. :t i [ R !. I r < :· V l e> l 4 l . 7 r . > ) ( :: ' : • i <;\ninderendent contractors. agents, members. guests and invitees (collectively, the \"Park Arca\nUsers\"), a nonexclusive easement over and across Section Four, or portions thereof as provided\nbelow, for the following purposes:\n( i) Flight of balls (which may include but not be limited to baseballs, softballs.\nfootballs, tennis balls, soccer balls, volley balls) over, across, and upon Section\nFour;\n(ii) Doing of every act necessary and incident to the playing of recreational activities\non or within the Park Area, including, lighting of parking facilities; and\n(iii) Creation of noise related to the nonnal maintenance, operation and recreational\nactivities of the Park Area, including, but not limited to, the operation of mowing\nand spraying equipment. Such noise may occur from early morning until late\nevening.\nDamage by Errant Sports Balls. Owners of Lots in Section Four, their successors and\nassigns, hereby acknowledge and agree that the existence of a Paik Arca within Section Four is\nbeneficial and highly desirable; however, each such Owner acknowledges and agrees that\nportions Section Four located adjacent to, or in close proximity to, the Park Area are subject to\nthe risk of damage or injury due to errant sports balls. Owners of portions of Section Four, their\nsuccessors and assigns, hereby assume the risk of damage and injury and hereby release the\nOwner of the Park Area, the Association and/or the Declarant, their agents, employees, officers,\nsuccessors and assigns, from any and all liability for damage or injury caused by errant sports\nballs in, on, or around Section Four.\nOwners of Lots within Section Four are hereby advised that there exist Reserves B and C\nwithin Section Four, which reserves are restricted to e<:juestrian paths, as shown on the recorded\nplat of Section Four (collectively, the \"Equestrian Paths\"). The Association shall not be liable\nfor any injury to or death of a person as a result of (i) such person's use of the Equestrian Paths\nor (ii) the inherent risk that may be associated with participation in equestrian activities and use\nof the Equestrian Paths. Further, Owners hereby agree to hold harmless the Declarant and the\nAssociation, and their successors and assigns and release them from any liability for the use of\nthe Equestrian Paths by such Owners, their guests and/or invitees, the existence and/or placement\nof the Equestrian Paths, and the presence of animals on the Equestrian Paths, and agree to\nindemnify the parties released from any damages they may sustain. Owners further grant an\n, easement to the Declarant and the Association for any incidental noise, odors, visibility of the\nEquestrian Paths or the animals on the Equestrian Paths, and/or traffic which may occur due to\nr\nthe existence of the Equestrian Paths or the animals on the Equestrian Paths. Owners hereby\nacknowledge that the Association, its directors, officers, managers, agents, or employees, the\nDeclarant or any successor Declarant have made no representations or warranties nor has any\nOwner, occupant, tenant, guest or invitee relied upon any representations or warranties,\nexpressed or implied. relative to any future change in use of the Equestrian Paths. The\nDeclaiant, its successors and assigns, and/or the Association has the right to promulgate rules\nand regulations governing the use of the Equestrian Paths."
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_4_-_11-02-2005.pdf",
    "page": 4,
    "text": "O1:,o1. ··,-~:;,\n.~, ~.::; ·-'! i 1.\ne\nr~\n.1\nr\n.\n:\n;\n·\nV\nl\nc1\nI -\nI\n;, '/\nf\n.\n.\n~\n•.\n1\n)\nI .1\nOwners of Lois within Section l·our arc advised that there exists Reserve \"[) '. which is\ndesignated as a drill site for any oil, gas and mineral development within Section Four (\"Reserve\n[)\"). Owners hereby agree to hold harmless the Declarant, the Association and their successors\nand assigns and release them from any liability for the existence, .placement, operation andJor\nmaintenance of Reserve [) and agree to indemnify the panics released from any damages they\nmay sustain. Owners acknowledge that there may be incidental noise. lighting, odors. andJor\ntraffic which may occur due to the existence andJor normal operation of Reserve D and Owners\nexpressly grant to the Declarant and the Association, an easement for incidental noise. lighting,\nodors and/or traffic which may occur due to the existence and/or normal operation of Reserve D.\nOwners funher acknowledge that the Association, its Directors, officers. managers.\nagents, or employees. or the Declarant or any successor Declarant have, made no representations\nor warranties nor has any Owner, occupant, tenant, guest or invitee relied upon any\nrepresentations or warranties, expressed or implied, relative to any future change in use of\nReserve D or regarding the affect of the drill site designation on. Reserve D. Owners whose Lot\nabut or are adjacent to Reserve D shall take care and shall not permit any trash, fertilizers,\nchemicals, petroleum products, environmental hai:anis or any other foreign matters to infiltTate\nReserve D. Any Owner permitting or causing such infiltration shall indemnify and hold\nhannless the Declarant, the Association and their successors and assigns for all costs of clean up\nand remediation necessary to restore Reserve D to its condition immediately prior to said\ninfiltration. Owners acknowledge that the Declarant and/or the Association may convey Reserve\nD to a person and/or entity other than the Association.\nOwners of Lots within Section Four are advised that there exists Reserve E in Section\nFour, which reserve is restricted to greenbelt purposes, as shown on the recorded plat of Section\nFour (\"Reserve E\"). The Association shall have the obligation to maintain Reserve E. Owners\nhereby agree to hold hannless the Declarant and the Association, and their successors and\nassigns and release them from any liability for the existence, placement, and/or maintenance of\nReserve E and agree to indemnify the parties released from any damages they may sustain.\nOwners acknowledge that there may be incidental noise, lighting, odors, and/or traffic which\nmay occur due to the existence and/or normal operation of Reserve E and Owners expressly\ngrant to the Association, an easement for incidental noise, lighting, odors and/or traffic which\nmay occur due to the existence and/or normal operation of Reserve E. Owners further\nacknowledge that the Association, its directors, officers, managers, agents, or employees, the\nDeclarant or any successor Declarant have made no representations or warranties nor has any\nOwner, occupant, tenant, guest or invitee relied upon any representations or warranties,\nexpressed or implied, relative to any future change in use of Reserve E.\nr\nr\nOwners whose Lots are adjacent to or abut Reserve E shall take care and shall not permit\nany trash, fenilizers, chemicals, petroleum products, environmenta.I hazards or any other foreign\nmaners to infiltrate Reserve E. Any Owner permitting or causing such infil1ra1ion shall\nindemnify and hold harmless the Association for all costs of clean up and remediation necessary\nto restore Reserve E to its condition immediately prior to said infiltration.\nOwners of l,01s I and 2. Glock I and Lots 24, 25 ..1 2. ll. 47, and 48, Glod II Section\n111\nFour are hereby advised that there exists a twenty-foot (25') drainage cascmcn1 along the"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_4_-_11-02-2005.pdf",
    "page": 5,
    "text": "I 1 ) :1 C 1 J ) - : : ? . •.1 __ :;·.>1_1 f r ! ; - :1 I< · f. \"f\n; I\nsouthern Lot lines or l,ots 24. 32. and 4 7. lllock 11 and the Nonhcrn Lot lines ol Lots 2 S. 3 .\\.\"'\"I\n48. Ellock II (twelve and one-hair rcct on each or the foregoing Lots). through and across l.ot I.\nBlock I. and along a ponion or the southern Lot line of Lot 2. lllock 1, as shown on the recorded\nplat of Section four (collectively. the \"Drainage Easements\"). Owners hereby agree to hold\nhannless the Dcclarant and the Association, and their successors and assigns and release them\nfrom any liability for the existence and/or placement of the Drainage Easements and agree to\nindemnify the panics released from any damages they may sustain. Owners runher grant an\neasement to the Declarant and the Association for any incidental noise, odors, visibility of the\nDrainage Easements, and/or traffic which may occur due to the existence of the Drainage\nEasements. Owners hereby acknowledge that the Association, its directors, officers, managers.\nagents, or employees, the Declarant or any successor Declarant have made no representations or\nwarranties nor has any Owner, occupant, tenant, guest or invitee relied upon any representations\nor warranties, expressed or implied, relative to water level variances and/or any foture change in\nuse of the Drainage Easements. Each Owner shall have the obligation of maintaining the ponion\nof the Drainage Easements on such Owner's Lot. Owners may .not obstruct, fill, alter the natural\nslope of, alter the topography of, or install any improvements on the Drainage Easements.\nOwners of Lots 2 and 3, Block ll, within Section Four are advised that there exists a\nDetention Pond Easement, within Lot 2, Block [I and adjacent to the southern Lot line of Lot 3,\nBlock If, as shown on the recorded plat of Section Four (the \"Detention Pond Easement\"). TI1e\nAssociation shall have the obligation to maintain the Detention Pond Easement. Owners hereby\nagree to hold harmless the Declarant and the Association, and their successors and assigns and\nrelease them from any liability for the existence, placement, and/or maintenance of the Detention\nPond Easement and agree to indemnify the parties released from any damages they may sustain.\nOwners acknowledge that there may be incidental noise, lighting, odors, and/or traffic which\nmay occur due to the existence and/or nonnal operation of the Detention Pond Easement and\nOwners expressly grant to the Association, an easement for incidental noise, lighting, odors\nand/or traffic which may oaur due lo the existence and/or nonnal operation of the Detention\nPond Easement. TI1e Declarant, its successors and assigns, and/or the Association has the right\nto promulgate rules and regulations governing the use of the Detention Pond Easement. Owners\nfurther acknowledge that the Association, its directors, officers, managers, agents, or employees,\nthe Declaranl or any successor Declarant have made no representations or warranties nor has any\nOwner, occupant, tenant, guest or invitee relied upon any representations or warranties.\nexpressed or implied, relative to water level variances and/or any future change in use of the\nDetention Pond Easement.\nOwners whose Lots are adjacent to or abut the Detention Pond Easement shall take care\n' and shall not permit any trash, fertilizers, chemicals, petroleum products, environmental hazards\nr\nor any other foreign matters to infiltrate the Detention Pond Easement. Any Owner permitting or\ncausing such infiltration shall indemnify and hold harmless the Association for all costs of clean\nup and remediation necessary to restore the Detention Pond Easement to its condition\nimmediately prior to said infiltration. Owners may not obstruct, fill, alter the natural slope of.\nalter the topography of. or install any improvements on the Detention Pond Casement.\nOwners or l,ots 4. 5. 6. 38. and 39 in Block 11, within Section Four arc advised 1li;1t\nponions or Lots 4. S. 6 . .l8. and 39 arc panially within the 100 year Oood plain line as scalccl"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_4_-_11-02-2005.pdf",
    "page": 6,
    "text": "l (1 ) 1 1 : .: 1 .. ). - _ :: ?1 i .) .J 1 i C r ~ .. · .: I r : ·· V I <.. I .> ~ I 7 ( · , . • ; ~ l ' 1 ~?.\n(ron1 a 1:.1 !( M Map The approxirna1c location of 1hc I 00 year Oood plain ''on the norihcrn\nand/or eastern poriions of Lots 4, 5. and 6 in Block 11 and on the western poriions of Lots 38 and\n39 in Block 11, as indicated on the recorded plat of Section Four. Owners of Lots 4, S. 6. 38. and\n39 in Block 11 acknowledge and understand that the Associa1ion, its Board of Directors, and/or\nthe Declarant, their successors and assigns, are not insurers and that each Owner and occupant of\nany Lot in Section Four and each tenant, guest and invitee of any Owner assumes all risks for\nloss or damage to persons as a resuli of the a portion of Lots 4, 5, 6, 38, and 39 in lllock II being\nlocated in the I 00 year Oood zone. Owners further acknowledge that the Association, its Board\nof Directors, and/or the Owner, their successors and assigns. have made no representations or\nwarranties nor has any Owner, occupan~ tenant, guest or invitee relied upon any representations\nor warranties, expressed or implied as to the flood plain line.\nOwners of Lots within Section Four are advised thal certain creeks (the \"Creeks\") run\nthrough and across portions of Section Four, as shown on the recorded plat of Section Four.\nOwners hereby agree to hold harmless the Declarant and the A<ssociation, and their successors\nand assigns and release them from any liability for the existence, placement, and/or maintenance\nof the Creeks and agree to indemnify the parties released from any damages they may sustain.\nOwners acknowledge that there may be incidental noise, odors, and/or traffic which may occur\ndue to the existence of !he Creeks and Owners expressly grant to the Association, an easement\nfor incidental noise, odors and/or traffic which may occur due to the existence of the Creeks.\nThe Declarant, its successors and assigns, and/or the Association has the right to promulgate\nrules and regulations governing the use of the Creeks. Owners further acknowledge !hat the\nAssociation, its directors, officers, managers, agents, or employees, the Declarant or any\nsuccessor Deelarant have made no representations or warranties nor has any Owner, occupant,\ntenant, guest or invitee relied upon any representations or warranties, expressed or implied.\nrelative lo water level variances and/or any future change in use of the Creeks.\nOwners on whose Lots adjoin the Creeks are lo.cated shall take care and shall not permit\nany trash, fertilizers, chemicals, petroleum products, environmental hazards or any other foreign\nmatters to infiltrate the Creeks. Any Owner permitting or causing such infiltration shall\nindemnify and hold harmless the Association for all costs of clean up and remediation necessary\nto restore the Creeks to their condition immediately prior to said infiltration. Each Owner shall\nhave the obligation of maintaining the portion of the Creek on such Owner's Lot. Owners may\nnot obstruct, fill, or alter the natural flow of the Creeks.\nOwners of Lots within Section Four are advised that running through a portion of Section\nFour there exists a Houston Lighting & Power Company one hundred eighty foot ( 180')\n' easement, more particularly described in Volume 251, Page 573 in the Grimes County Deed\nr\nRecords (the \"HL&P Easement\"). Owners hereby agree to hold harmless the Deelarant and the\nAssociation. and their successors and assigns and release them from any liability for the\nexistence, placement, and/or maintenance of the HL&P Easement and agree to indemnify the\nparties released from any damages !hey may sustain. Owners acknowledge that there may be\nincidental noise, lighting, odors, and/or traffic which may occur due to 1hc existence and/or\nnormal operation of !he HL&P Easemenl and Owners expressly grant to !he Association. an\ncasement for incidental noise, lighting. odors and/or traffic which rnay occur due to the existence\nand/or normal opcra1ion of the ljL&P Easemenl. Owners fur1her acknowledge Iha! tile"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_4_-_11-02-2005.pdf",
    "page": 7,
    "text": "0 C> • ~ f!-1: V C>) !'>9\n(lr ')1_1::;:·21 l Rr· l .1 4 l :·:; l ~)\nAssociation. its directors, officers. managers, agents. or employees. the Dcclaran1 or any\nsuccessor Dcclarant have made no representations or warranties nor has any Owner. occupant.\ntenant, guest or invitee relied upon any representa1ions or warranties. expressed or implied.\nrelative to any fu1ure change in use of the HL&P Easement.\nOwners whose on whose Lots the HL&P Easement is located shall take care and shall not\npermit any trash, fertilizers, chemicals. petroleum products, environmental hazards or any other\nforeign maners to infiltrate the HL&P Easement. Any Owner perrnit1ing or causing such\ninfiltration shall indemnify and hold harmless the Association for all costs of clean up and\nremediation necessary to restore the HL&P Easement to its condition immediately prior to said\ninfiltration. Each Owner shall have the obligation of maintaining the portion of the HL&P\nEasement on such Owner's Lot. Owners may not obstruct, fill, alter the natural slope of, alter\nthe topography of. or install any improvements on the H L&P Easement.\nOwners of Lot 2, Block I and Lots 36 and 37, Block 11, 'within Section Four are advised\nthat there exists a twenty foot (20') access easement along the northern perimeter of Lot 2, Block\nI and a twenty foot (20') access easement along the southern Lot line of Lot 36, Block If and the\nnorthern Lot line of 37, Block ll (ten feet on each Lot), as shown on the recorded plat of Section\nFour (collectively, the \"Access Easements\"). The Association shall have the obligation to\nmaintain the Access Easements. Owners hereby agree to hold harmless the Declarant and the\nAssociation, and their successors and assigns and release them from any liability for the\nexistence, placement, and/or maintenance of the Access Easements and agree to indemnify the\nparties released from any damages they may sustain. Owners acknowledge that there may be\nincidental noise, lighting, odors, and/or traffic which may occur due to the existence and/or\nnormal operation of the Access Easements and Owners expressly grant to the Association, an\neasement for incidental noise, lighting, odors and/or traffic which may occur due to the existence\nand/or normal operation of the Access Easements. The Access Easements are only for the\nbenefit of and/or use by the Declarant, its successors, assigns, representatives, agents,\nrepresentatives, and designees, and/or the Association, its agents, representatives and designees.\nOwners further acknowledge that the Association, its directors, officers, managers, agents, or\nemployees, the Declarant or any successor Declarant have made no representations or warranties\nnor has any Owner, occupant, tenant, guest or invitee relied upon any representations or\nwarranties, expressed or implied, relative to any future change in use of the Access Easements.\nOwners whose Lots are adjacent to or abut the Access Easements shall take care and shall\nnot permit any trash, fertilizers, chemicals, petroleum products, environmental hazards or any\nother foreign matters to infiltrate the Access Easements. Any Owner permitting or causing such\n'\ninfiltration shall indemnify and hold harmless the Association for all costs of clean up and\nr\nremediation necessary to restore the Access Easements to its condition immediately prior to said\ninfiltration. Owners may not obstruct, fill, alter the natural slope of, alter the topography of. or\ninstall any improvements on the Access Easements.\nFencing may be installed on Lots which abut green belts. lakes. ponds. park areas and\nother landscaping reserves. subject to prior ARC approval. If fencing is installed on any portion\nof a Lot which abuts greenbel1s, lakes. ponds, park areas and other landscaping reserves. it shall\nbe wrought iron in appearance and shall be in a location and of a material and design as required"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_4_-_11-02-2005.pdf",
    "page": 8,
    "text": "Do·:.: C::-1< Vol\n(1 1 ~1 ·.:>, :1 3 .:.2 1 1 R r> 1 l /, \"7\nin this Section and as approved by the ARC. However. access to such green belts, lakes. ponds.\npark areas and/or other landscaping reserves. if any, shall be through approved access points\nlocated on the Common Areas only. Gate access from individual Lots is strictly prohibited\nexcept on rear Lot lines adjacent to green belts, which rear gates, if installed, are subject to prior\nARC appnoval. An.Owner's Lot shall be considered a abutting a lake, pond, or park area for\nfencing requirements· even if a Common Area is between the Lot and such lake, pond or park\narea.\nSpecial Fencing Requirements: Side fencing between any and all Lots, if any is installed,\nwhere the rear and/or side of the Lot abuts and/or is contiguous or adjoining 10 green belts, lakes.\nponds, park areas or other landscaping reserves shall be black ornamental iron in appearance.\nunless otherwise approved, in writing, by the ARC. All such fencing, if installed, shall not\nexceed four feet (4') in height and must conform to all ARC requirements.\nSubject to the special fencing requirements set out hereinabove, side and rear fencing\nmay be installed on all Lots; provided, such fencing is not a barbed wire or a chain link fence.\nOwners shall be responsible for the maintenance, repair and/or replacement of all fences\nin existence at time of transfer from Builder to Owner. Replacement fences shall be of a similar\nmaterial and design as originally constructed. TI1e maintenance of any portion of a fence which\nlies between Lots shall be the joint responsibility of each Lot Owner on whose property the fence\nlies between. ln the event an Owner fails to repair, replace or maintain said fence in a manner\nconsistent with the Subdivision in the sole discretion of the Board of Directors, the Association\nshall have the right, but not the obi igation, to enter such Lot for the repair and/or replacement of\nsuch fence after notice to the Owner. Any expense incurred by the Association in effecruating\nsuch repairs/replacement shall be the responsibility of the Owner and shall be secured by ihe\ncontinuing lien on the Lot.\nSection Four shall be held, transferred, sold, conveyed, used and occupied subjecl to the\ncovenants, restrictions, easements, charges, and liens set forth in the Declaration (the same being\nherein incorporated by reference for all purposes), and additionally this Supplemental\nAmendment.\nIn case of conflict between this Supplemental Amendment and the Declaration, this\nSupplemental Amendment shall control. All other definitions and restriction shall remain as\nstated in the Declaration.\nr\nInvalidation of any one or more of the covenants, restrictions conditions or provisions\nr\ncontained in this Supplemental Amendment shall in no wise affect any of the other covenants,\nrestrictions, conditions or provisions which shall remain in full force and effect.\n(SIGNATURE PAGE FOLLOWS)"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_4_-_11-02-2005.pdf",
    "page": 9,
    "text": "Do·:.: e.i.:\nVo]_\n1)():21)3:::?: 1 1 RF·\nl 1 4 '?\nIN WITNESS WHEREOF, this Supplemental Amendment to the Declaration of\nCovenants, Conditions and Restrictions for Plantation Lakes, Section four is executed as of the\n15f day of f(OUCfl<.W , 2005.\nDECLARANT:\nMILL CREEK, LTD., a Texas limited\npartnership\nBy: CLEAR DEVELOPMENT\nGRO .C. a exas corporation, its\ngen I partn\nBy:_~e!t==:::~---\nPrint Name: -+----\\--==;:..c\"'-=--\"-\"-'-\"\"----\nPrint Title: -~--+-.2.1..='-\"\"><.!,.-----\nSTA TE OF TEXAS §\n§\nCOUNTY OF fl1tJ1t.f6yJ~\nBEFORE ME, the undersigned authority, on this day personally appeared\nUa4 Sujloi., , the />,u__71tfuu- of Clear Springs Development Group, L.L.C., a\nTexas corporation, the General Partner of Mill Creek, Ltd., a Texas limited partnership known by\nme to be the person whose name is subscribed to the foregoing instrument, and acknowledged to\nme that s/he executed the same for the purposes and consideration therein expressed and in the\ncapacity therein expressed.\nG!VEN UNDER MY HAND AND SEAL OF OFFICE, this j$t' day of Nov~\n2005.\nNotary Public - State of Texas\n,\n,\no'\"'\"v<I:: KARLA M DARDEN\n?~i\\\nA !\\er R<corlling Return To: NOTARY PUBLIC\n~~ij State of Toxas\nMarc 0. Markcl/Richa Himani ''<£'._'$- Comm. Ex:p. 01-05-2009\nRoberts Marl:cl Guerry. P.C.\n2500 City West Blvd .. Suite 1350\nHouston. TX 77042\n0"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_4_-_11-02-2005.pdf",
    "page": 10,
    "text": "Oo·:: e.1-: v () l\n1:1 (.·• 21:1 .3 :? t L R r:· l .I. ;,. '7 F·9\n.3 ·1 I.'\nLIENHOLDER CONSENT AND SUBORDINATION\n/Jr;;,f bMf:- of Cu11tOG, tJd. a(n) /e:l!'?t s State _ Corporation.\nbeing the sole beneficiary of a mortgage lien and other liens, assignments and ecurity interests\nencumbering all or a portion of the Property hereby consents to the tenns and provisions of this\nSupplemental Amendment to the Declaration of Covenants, Conditions and Restrictions for\nPlantation Lakes, Section Four to which this Lienholder Consent and Subordination is attached\nand acknowledges that the execution thereof does not constitute a default under the lien\ndocument or any other document executed in connection with or as security for the indebtedness\nabove described, and subordinates the liens of the lien document and any other liens and/or\nsecurity instruments securing said indebtedness to the rights and interests created under the\nDeclaration, and acknowledges and agrees that a foreclosure of said liens and/or security\ninterests shall not extinguish the rights, obligations and interests created under the Declaration.\nNo warranties of title are hereby made by lienholder, lienholder's joinder herein being solely\nlimited to such consent and subordination.\nST A TE OF TEXAS §\n§\n/!JoNfyO!tiu?/§\nCOUNTY OF\nBEFORE ME. the undersigned authority, on this day personally appeared\n------~ ---,------- of known by me to be\nthe person whose name is subscribed to the foregoing instrument, and acknowledged to me that\ns/he executed the same for the purposes and consideration therein expressed and in her/his\nrepresentative capacity.\n5T\nGIVEN UNDER my hand and seal of office, this ( day of\nNovt::/JJl2 Gr<- . 20os.\n'\nr\nNotary Public - State of Texas\nAfter Recording Return To:\nMarc D. Markel/Richa H.imani\nRoberts Markel Guerry, P.C.\n2500 City West Blvd., Suite I }50\nHouston. TX 77042"
  },
  {
    "document": "Supplemental_Amendment_to_the_Declaration_of_Covenants,_Conditions_&_Restrictions_-_Sec_4_-_11-02-2005.pdf",
    "page": 11,
    "text": "Do·= EH' Vo 1.\n.. 00'.203'.211 RF' 1147\n:\n,. ,; .,,:\n·1: ; , .\nFiled for Record in:\nGr i •es Count., '\nOn: Nov 0212005 •t oe:(3A\nAs o RfCOROH!GS\nOocuoent Hunber: 00203211\nAnounl · 1 51.00\nRecei•t Huober - 1191\nt•1 Tino S Schroeder\nSTATE OF TEXAS COUHTY OF GR!tl£S\nI hereb• certify tknt this instru•ent uns\nriled \"\" the dnle •nd l i •e stonoed hereon h• ••\na.nd va.s ·dul~· recoc·ded in the' ·volutte nnd PnJI!\nor the nued records or:\nGri•es County\nns stnaoed ~ereoa b~ ae.\nllov 02r2005\nOovid P•skel1 Count• Clerk\nGr i til!S Counb1\n.:•;"
  }
]